Revit 2024 API
RebarReinforcementData Class
 class containing the id and the end of rebar on which the coupler stays
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class RebarReinforcementData : ReinforcementData
Visual Basic
Public Class RebarReinforcementData _
	Inherits ReinforcementData
Visual C++
public ref class RebarReinforcementData : public ReinforcementData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ReinforcementData
 Autodesk.Revit.DB.Structure.RebarReinforcementData
See Also
RebarReinforcementData Members
Autodesk.Revit.DB.Structure Namespace